mulcmu/Modernize-Harmony-880/msp430/src/main.c

#include <msp430.h>
#include <msp430g2553.h>

//Macros for bitwise operations
#define BitSet(arg,bits) ((arg) |= (bits))
#define BitClear(arg,bits) ((arg) &= ~(bits))
#define BitFlip(arg,bits) ((arg) ^= (bits))
#define BitTest(arg,bits) ((arg) & (bits))


volatile char i;
char counter=0;


void delay_ms(unsigned int ms)
{
	while (ms)
	{
		__delay_cycles(16000); 
		ms--;
	}
}

#pragma vector=PORT2_VECTOR
__interrupt void PORT2_ISR_HOOK(void)
{
	P2IFG = 0;

	P1OUT ^= BIT6;

	P3OUT=BIT0;

	/* Start timer in up mode */
    TA0CTL |= MC_1;

    P2IE = 0;

    counter=1;
}

#pragma vector=TIMER0_A0_VECTOR
__interrupt void TIMER0_A0_ISR_HOOK(void)
{
	char button = 0;

	switch (P3OUT)  {
	case BIT0: //ROWA
		switch (P2IN) {
		case BIT0:
			button = 1;
			break;
		case BIT1:
			button = 5;
			break;
		case BIT2:
			button = 9;
			break;
		case BIT3:
			button = 13;
			break;
		case BIT4:
			button = 17;
			break;
		case BIT5:
			button = 21;
			break;
		case BIT6:
			button = 25;
			break;
		}
		break;
	case BIT1:  //ROWB
		switch (P2IN) {
		case BIT0:
			button = 2;
			break;
		case BIT1:
			button = 6;
			break;
		case BIT2:
			button = 10;
			break;
		case BIT3:
			button = 14;
			break;
		case BIT4:
			button = 18;
			break;
		case BIT5:
			button = 22;
			break;
		case BIT6:
			button = 26;
			break;
		}
		break;
	case BIT2:  //ROWC
		switch (P2IN) {
		case BIT0:
			button = 3;
			break;
		case BIT1:
			button = 7;
			break;
		case BIT2:
			button = 11;
			break;
		case BIT3:
			button = 15;
			break;
		case BIT4:
			button = 19;
			break;
		case BIT5:
			button = 23;
			break;
		case BIT6:
			button = 27;
			break;
		}
		break;
	case BIT3: //ROWD
		switch (P2IN) {
		case BIT0:
			button = 4;
			break;
		case BIT1:
			button = 8;
			break;
		case BIT2:
			button = 12;
			break;
		case BIT3:
			button = 16;
			break;
		case BIT4:
			button = 20;
			break;
		case BIT5:
			button = 24;
			break;
		case BIT6:
			button = 28;
			break;
		}
		break;
	case BIT4: //ROWE
		switch (P2IN) {
		case BIT0:
			button = 42;
			break;
		case BIT1:
			button = 46;
			break;
		case BIT2:
			button = 50;
			break;
		case BIT3:
			button = 29;
			break;
		case BIT4:
			button = 33;
			break;
		case BIT5:
			button = 37;
			break;
		case BIT6:
			button = 41;
			break;
		}
		break;
	case BIT5: //ROWF
		switch (P2IN) {
		case BIT0:
			button = 43;
			break;
		case BIT1:
			button = 47;
			break;
		case BIT2:
			button = 51;
			break;
		case BIT3:
			button = 30;
			break;
		case BIT4:
			button = 34;
			break;
		case BIT5:
			button = 38;
			break;
		}
		break;
	case BIT6: //ROWG
		switch (P2IN) {
		case BIT0:
			button = 44;
			break;
		case BIT1:
			button = 48;
			break;
		case BIT2:
			button = 52;
			break;
		case BIT3:
			button = 31;
			break;
		case BIT4:
			button = 35;
			break;
		case BIT5:
			button = 39;
			break;
		}
		break;
	case BIT7: //ROWH
		switch (P2IN) {
		case BIT0:
			button = 45;
			break;
		case BIT1:
			button = 49;
			break;
		case BIT2:
			button = 53;
			break;
		case BIT3:
			button = 32;
			break;
		case BIT4:
			button = 36;
			break;
		case BIT5:
			button = 40;
			break;
		}
		break;


	}  //switch P3OUT


	if(button == 0)
		counter++;
	else
	  UCA0TXBUF = button;

	P3OUT = P3OUT << 1;

	if (P3OUT==0)
		P3OUT = BIT0;

	if (counter == 0xFF) {
		TA0CTL &= ~(MC1 + MC0);
		P3OUT = 0xFF;
		UCA0TXBUF = 0xFF;
		P2IE = 0xFF;
	}
}


int main(void)
{

    /* Stop watchdog timer from timing out during initial start-up. */
    WDTCTL = WDTPW | WDTHOLD;

    /* Port 1 Port Select 2 Register */
    P1SEL2 = BIT1 | BIT2;

    /* Port 1 Output Register */
    P1OUT = BIT6;

    /* Port 1 Port Select Register */
    P1SEL = BIT1 | BIT2;

    /* Port 1 Direction Register */
    P1DIR = BIT6;

    /* Port 1 Interrupt Edge Select Register */
    P1IES = 0;

    /* Port 1 Interrupt Flag Register */
    P1IFG = 0;

    /* Port 2 Output Register */
    P2OUT = 0;

    /* Port 2 Port Select Register */
    P2SEL &= ~(BIT6 | BIT7);

    /* Port 2 Direction Register */
    P2DIR = 0;

    /* Port 2 Resistor Enable Register */
    P2REN = BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7;

    /* Port 2 Interrupt Edge Select Register */
    P2IES = 0;

    /* Port 2 Interrupt Flag Register */
    P2IFG = 0;

    /* Port 2 Interrupt Enable Register */
    P2IE = BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7;

    /* Port 3 Output Register */
    P3OUT = BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7;

    /* Port 3 Direction Register */
    P3DIR = BIT0 | BIT1 | BIT2 | BIT3 | BIT4 | BIT5 | BIT6 | BIT7;

    /* 
     * Basic Clock System Control 2
     * 
     * SELM_0 -- DCOCLK
     * DIVM_0 -- Divide by 1
     * ~SELS -- DCOCLK
     * DIVS_0 -- Divide by 1
     * ~DCOR -- DCO uses internal resistor
     * 
     * Note: ~<BIT> indicates that <BIT> has value zero
     */
    BCSCTL2 = SELM_0 | DIVM_0 | DIVS_0;

    if (CALBC1_16MHZ != 0xFF) {
        /* Adjust this accordingly to your VCC rise time */
        __delay_cycles(100000);

        /* Follow recommended flow. First, clear all DCOx and MODx bits. Then
         * apply new RSELx values. Finally, apply new DCOx and MODx bit values.
         */
        DCOCTL = 0x00;
        BCSCTL1 = CALBC1_16MHZ;     /* Set DCO to 16MHz */
        DCOCTL = CALDCO_16MHZ;
    }

    /* 
     * Basic Clock System Control 1
     * 
     * XT2OFF -- Disable XT2CLK
     * ~XTS -- Low Frequency
     * DIVA_0 -- Divide by 1
     * 
     * Note: ~XTS indicates that XTS has value zero
     */
    BCSCTL1 |= XT2OFF | DIVA_0;

    /* 
     * Basic Clock System Control 3
     * 
     * XT2S_0 -- 0.4 - 1 MHz
     * LFXT1S_2 -- If XTS = 0, XT1 = VLOCLK ; If XTS = 1, XT1 = 3 - 16-MHz crystal or resonator
     * XCAP_1 -- ~6 pF
     */
    BCSCTL3 = XT2S_0 | LFXT1S_2 | XCAP_1;


   /* Disable USCI */
    UCA0CTL1 |= UCSWRST;

    /* 
     * Control Register 1
     * 
     * UCSSEL_2 -- SMCLK
     * ~UCRXEIE -- Erroneous characters rejected and UCAxRXIFG is not set
     * ~UCBRKIE -- Received break characters do not set UCAxRXIFG
     * ~UCDORM -- Not dormant. All received characters will set UCAxRXIFG
     * ~UCTXADDR -- Next frame transmitted is data
     * ~UCTXBRK -- Next frame transmitted is not a break
     * UCSWRST -- Enabled. USCI logic held in reset state
     * 
     * Note: ~<BIT> indicates that <BIT> has value zero
     */
    UCA0CTL1 = UCSSEL_2 | UCSWRST;
    
    /* 
     * Modulation Control Register
     * 
     * UCBRF_0 -- First stage 0
     * UCBRS_7 -- Second stage 7
     * ~UCOS16 -- Disabled
     * 
     * Note: ~UCOS16 indicates that UCOS16 has value zero
     */
    UCA0MCTL = UCBRF_0 | UCBRS_7;
    
    /* Baud rate control register 0 */
    UCA0BR0 = 138;
    
    /* Enable USCI */
    UCA0CTL1 &= ~UCSWRST;

/* 
     * TA0CCTL0, Capture/Compare Control Register 0
     * 
     * CM_0 -- No Capture
     * CCIS_0 -- CCIxA
     * ~SCS -- Asynchronous Capture
     * ~SCCI -- Latched capture signal (read)
     * ~CAP -- Compare mode
     * OUTMOD_0 -- PWM output mode: 0 - OUT bit value
     * 
     * Note: ~<BIT> indicates that <BIT> has value zero
     */
    TA0CCTL0 = CM_0 | CCIS_0 | OUTMOD_0 | CCIE;

    /* TA0CCR0, Timer_A Capture/Compare Register 0 */
    TA0CCR0 = 11;

    /* 
     * TA0CTL, Timer_A3 Control Register
     * 
     * TASSEL_1 -- ACLK
     * ID_0 -- Divider - /1
     * MC_1 -- Up Mode
     */
    TA0CTL = TASSEL_1 | ID_0 | MC_1;


    // do
    // {
    //     // Clear OSC fault flag
    //     IFG1 &= ~OFIFG;

    //     // 50us delay
    //     __delay_cycles(800);
    // } while (IFG1 & OFIFG);

    /* 
     * SR, Status Register
     * 
     * ~SCG1 -- Disable System clock generator 1
     * ~SCG0 -- Disable System clock generator 0
     * ~OSCOFF -- Oscillator On
     * ~CPUOFF -- CPU On
     * GIE -- General interrupt enable
     * 
     * Note: ~<BIT> indicates that <BIT> has value zero
     */
    __bis_SR_register(GIE);

    __enable_interrupt();

    /* Clear MCx bits to stop timer */
	TA0CTL &= ~(MC1 + MC0);

    // __disable_interrupt();

    // P1DIR |= 0x01;


    while (1)
    {
        // i++;
        // UCA0TXBUF=i;
        // delay_ms(1500);
        // P1OUT ^= 0x01;    
    }

    return 0;
}
